{
  "sodium.options.buttons.donate": "Support Sodium!",
  "sodium.options.gui_scale.tooltip": "Sets the maximum scale factor to be used for the user interface. If sets to 0, then the largest scale factor will always be used.",
  "sodium.options.v_sync.tooltip": "If enabled, the game's frame rate will be synchronized to the monitor's refresh rate, making for a generally smoother experience at the expense of overall input latency. This setting might reduce performance if your system is too slow.\n§aCbscfe: Keep it OFF in most scenarios.",
  "sodium.options.fps_limit.tooltip": "Limits the maximum number of frames per second. If VSync is enabled, this option will be ignored unless it is lower than your display's refresh rate.",
  "sodium.options.view_bobbing.tooltip": "If enabled, the player's view will sway and bob when moving around.",
  "sodium.options.graphics_quality.tooltip": "If the options below are left to \"Default\", they will use this setting.",
  "sodium.options.clouds_quality.tooltip": "The quality level used for rendering clouds in the sky.\n§aCbscfe: \"Fast\" and \"Fancy\" are nearly the same",
  "sodium.options.weather_quality.tooltip": "Controls the distance that rain and snow effects",
  "sodium.options.leaves_quality.tooltip": "Controls leaves transparent (fancy) or opaque (fast).\n§aCbscfe:Leaves may be glitchy if you're not on \"fancy\".",
  "sodium.options.particle_quality.name": "Particles",
  "sodium.options.particle_quality.tooltip": "Controls the number of particles which can be on screen",
  "sodium.options.smooth_lighting.tooltip": "Enables the smooth lighting and shading of blocks in the world.",
  "sodium.options.entity_distance.tooltip": "The render distance multiplier used by entity rendering. larger values increase the maximum distance at which entities will be rendered, But sacrifices frame rates.",
  "sodium.options.entity_shadows.tooltip": "If enabled, basic shadows will be rendered.",
  "sodium.options.mipmap_levels.tooltip": "Controls the number of mipmaps which will be used for block model textures. Higher values provide better rendering of blocks in the distance, but could adversely affect performance with resource packs that use many animated textures.\n§aCbscfe: what it does in game, is that it affects moiré patterns. On high values moiré patterns will decrease.",
  "sodium.options.use_block_face_culling.tooltip": "If enabled, only the faces of blocks which are facing the camera will be submitted for rendering. Which greatly improves rendering performance. If your resource packs looks glitchy, try disabling it.\n§aCbscfe: Keep it ON, It's good for you.",
  "sodium.options.use_fog_occlusion.tooltip": "If enabled, chunks which are determined to be fully hidden by fog effects will not be rendered, helping to improve performance. but it may cause undesirable visual artifacts between the sky and fog in some scenarios.",
  "sodium.options.use_entity_culling.tooltip": "If enabled, entities not inside of a visible chunk, will be skipped during rendering. This optimization uses the visibility data which already exists for chunk rendering and does not add overhead.\n§aCbscfe:Still keep it ON",
  "sodium.options.animate_only_visible_textures.tooltip": "If enabled, only the animated textures which are determined to be visible in the current image will be updated. This can provide a significant performance improvement on some hardware, especially with heavier resource packs. If you experience issues with some textures not being animated, try disabling this option.\n§aCbscfe:Yes, keep it ON",
  "sodium.options.use_persistent_mapping.tooltip": "If enabled, persistent memory mappings will be used for the staging buffer so that unnecessary memory copies can be avoided.\n§aCbscfe: Requires OpenGL 4.4 or ARB_buffer_storage.",
  "sodium.options.cpu_render_ahead_limit.tooltip": "Specifies the maximum number of frames which can be in-flight to the GPU. Very low or high values may create frame rate instability.",
  "sodium_not_found.options.use_particle_culling.tooltip": "启用后仅渲染你视角范围内的粒子.在处于较多粒子的场景中,这可以显著提高帧率."
}